Tekla.Structures.Analysis.AnalysisDesignParameter
The AnalysisDesignParameter class contains information related to analysis design parameters.

Tekla.Structures.Analysis.AnalysisDesignParameter.value
The value of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameter.#ctor(System.Int32)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisDesignParameter class.
materialType:
The material type of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameter.#ctor(System.String,System.Int32,Tekla.Structures.Identifier,System.Double)
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisDesignParameter class.
analysisModelName:  The analysis model name.
parameterId:  The analysis design parameter ID.
partId:  The father part ID.
value:  The value.

Tekla.Structures.Analysis.AnalysisDesignParameter.Value
Gets or sets the value of the analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameter.Select
Selects an analysis design parameter.

Tekla.Structures.Analysis.AnalysisDesignParameter.Modify
Modifies an analysis design parameter.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisDesignParameter.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisDesignParameter.ModifyInstance
DO NOT USE! For internal usage only!